"""Этот модуль обеспечивает и обрабатывает получение новых заказов"""


def get_new_order():
    """Этот метод "получает информцию о поступлении" нового заказа или запрашивает его в БД"""
    pass



def new_order_handler():
    """Обрабатывает уведомление о получении нового заказа.
    - проверить есть ли заказ уже в работе
    - сформировать экземпляр класса Order
    - провести сортировку
    - записать в БД данные о заказе (какую то)
    - обновить время освобождения манипулятора в БД """
    pass

if __name__ == "__main__":
    get_new_order()
